# SetOriginAbsolute

## Description
Procedure SetOriginAbsolute sets the position of the origin relative to the center of the document drawing space.&lt;BR&gt;

```pascal
PROCEDURE SetOriginAbsolute(
				xValue : REAL;
				yValue : REAL);
```

```python

def vs.SetOriginAbsolute(xValue, yValue):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|xValue|REAL|X coordinate of origin.|
|yValue|REAL|Y coordinate of origin.|

## See Also
VS Functions:
SetOrigin

## Version
Availability: from VectorWorks8.0
## Category
* Document Settings